app/controllers/courses_controller.rb

  def list
    @course=Course.all
---
SELECT "courses".* FROM "courses"

  def select
    @course=Course.find_by_id(params[:id])
    flag=false
    current_user.courses.each do
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 12]]
SELECT "courses".* FROM "courses" INNER JOIN "grades" ON "courses"."id" = "grades"."course_id" WHERE "grades"."user_id" = $1  [["user_id", 36]]

  def quit
    @course=Course.find_by_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 9]]